name: "TrafficSignMPeemen"
layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param { shape: { dim: 1 dim: 720 dim: 1280 } }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  convolution_param {
    num_output: 6
    kernel_size: 6
    stride: 2
  }
  blobs {
    data: 1.40625
    data: 1.98828125
    data: 1.42578125
    data: 1.73828125
    data: 2.46484375
    data: 1.56640625
    data: 3.11328125
    data: 4.73046875
    data: 3.29296875
    data: 2.9296875
    data: 3.01953125
    data: 1.76953125
    data: 1.77734375
    data: 2.90625
    data: 1.87109375
    data: 0.375
    data: -1.83984375
    data: -1.47265625
    data: -0.9375
    data: -1.70703125
    data: -2.0234375
    data: -2.91015625
    data: -4.6015625
    data: -2.9453125
    data: -2.37890625
    data: -4.3125
    data: -4.109375
    data: -2.85546875
    data: -1.38671875
    data: -0.70703125
    data: -1.37109375
    data: -2.44140625
    data: -2.08203125
    data: -0.7578125
    data: 0.81640625
    data: 0.56640625
    data: -0.9609375
    data: -1.5
    data: -0.84765625
    data: -0.67578125
    data: -1.0078125
    data: -0.64453125
    data: -1.56640625
    data: -2.56640625
    data: -2.02734375
    data: -2.453125
    data: -3.765625
    data: -2.34375
    data: -0.7890625
    data: -1.4765625
    data: -1.73828125
    data: -2.61328125
    data: -4.37109375
    data: -2.80859375
    data: 0.5
    data: 0.75
    data: 0.71875
    data: 0.546875
    data: -0.71875
    data: -0.80078125
    data: 1.921875
    data: 3.42578125
    data: 3.765625
    data: 4.3984375
    data: 3.33984375
    data: 1.203125
    data: 1.23828125
    data: 2.265625
    data: 2.4921875
    data: 3.015625
    data: 2.44921875
    data: 0.89453125
    data: 0.171875
    data: -0.890625
    data: -1.84765625
    data: 0.04296875
    data: 1.9921875
    data: 1.1640625
    data: -0.671875
    data: -2.14453125
    data: -2.37109375
    data: 0.5859375
    data: 3.20703125
    data: 1.71875
    data: -1.2265625
    data: -1.4453125
    data: -0.046875
    data: 0.9453125
    data: 1.1484375
    data: 0.375
    data: 0.58984375
    data: 1.109375
    data: 0.703125
    data: -0.55859375
    data: -1.984375
    data: -1.2421875
    data: 3.2890625
    data: 3.55859375
    data: -0.53125
    data: -3.0703125
    data: -4.0
    data: -1.734375
    data: 2.3125
    data: 2.25390625
    data: -0.7578125
    data: -2.109375
    data: -2.08203125
    data: -0.671875
    data: 2.3828125
    data: 4.19140625
    data: 2.05859375
    data: -1.05859375
    data: -2.046875
    data: -0.73828125
    data: 2.85546875
    data: 5.71484375
    data: 3.59375
    data: -1.6171875
    data: -4.0078125
    data: -1.65234375
    data: 0.43359375
    data: 2.77734375
    data: 3.1796875
    data: -1.3359375
    data: -3.78515625
    data: -1.61328125
    data: -0.6640625
    data: 1.81640625
    data: 3.0234375
    data: -2.11328125
    data: -3.9375
    data: -1.28125
    data: -1.24609375
    data: 1.93359375
    data: 4.5390625
    data: -1.78125
    data: -5.33984375
    data: -2.19921875
    data: -0.6171875
    data: 1.37109375
    data: 3.1640625
    data: -0.4453125
    data: -3.23046875
    data: -1.61328125
    data: -1.29296875
    data: 1.609375
    data: 2.125
    data: -3.16015625
    data: -1.80078125
    data: 0.58203125
    data: -0.85546875
    data: 4.46875
    data: 2.44921875
    data: -5.6484375
    data: -1.2265625
    data: 1.546875
    data: 2.24609375
    data: 5.26171875
    data: -2.49609375
    data: -6.19140625
    data: 1.015625
    data: 1.6953125
    data: 3.94921875
    data: 5.32421875
    data: -4.35546875
    data: -5.296875
    data: 2.08203125
    data: 1.64453125
    data: 1.5625
    data: 0.34375
    data: -4.9765625
    data: -1.15234375
    data: 2.6640625
    data: 0.05859375
    data: -0.578125
    data: -2.578125
    data: -3.44140625
    data: 0.44140625
    data: 1.0234375
    data: -0.859375
    data: 2.1875
    data: 1.16015625
    data: -3.5625
    data: -1.5390625
    data: 1.671875
    data: 0.67578125
    data: 2.90234375
    data: -0.91015625
    data: -8.1796875
    data: -0.984375
    data: 4.41015625
    data: 1.0234375
    data: 1.984375
    data: -3.7578125
    data: -8.48828125
    data: 3.15234375
    data: 6.36328125
    data: 0.4609375
    data: 1.18359375
    data: -4.140625
    data: -5.71875
    data: 6.05078125
    data: 5.38671875
    data: -1.0625
    data: -1.30859375
    data: -3.75
    data: 0.30859375
    data: 7.390625
    data: 0.3515625
    data: -4.28515625
    data: -1.21875
    data: -1.296875
    data: 2.15625
    data: 3.93359375
    data: -1.41015625
    data: -3.109375
    shape {
      dim: 1
      dim: 6
      dim: 6
      dim: 6
    }
  }
  blobs {
    data: -1.8828125
    data: -1.5390625
    data: -1.2890625
    data: -1.27734375
    data: -1.5703125
    data: -1.91796875
    shape {
      dim: 6
    }
  }
}
layer {
  name: "act1"
  bottom: "conv1"
  top: "conv1"
  type: "Sigmoid"
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "conv1"
  top: "conv2"
  convolution_param {
    num_output: 16
    kernel_size: 6
    stride: 2
  }
  blobs {
    data: -0.12109375
    data: -0.26953125
    data: -0.3515625
    data: -0.44140625
    data: -0.46875
    data: -0.23046875
    data: -0.25390625
    data: -0.44140625
    data: -0.40625
    data: -0.51171875
    data: -0.4765625
    data: -0.1796875
    data: -0.234375
    data: -0.171875
    data: 0.10546875
    data: 0.17578125
    data: 0.35546875
    data: 0.22265625
    data: 0.0546875
    data: 0.203125
    data: 0.34375
    data: 0.625
    data: 0.78515625
    data: 0.35546875
    data: 0.140625
    data: 0.3203125
    data: 0.38671875
    data: 0.69140625
    data: 0.78125
    data: 0.30078125
    data: -0.01171875
    data: 0.1171875
    data: 0.19921875
    data: 0.31640625
    data: 0.359375
    data: 0.1171875
    data: 0.12890625
    data: 0.12890625
    data: -0.015625
    data: -0.03515625
    data: 0.05859375
    data: 0.07421875
    data: 0.1953125
    data: 0.12890625
    data: -0.30859375
    data: -0.29296875
    data: 0.08203125
    data: 0.12890625
    data: 0.078125
    data: -0.04296875
    data: -0.54296875
    data: -0.52734375
    data: 0.0625
    data: 0.1640625
    data: -0.13671875
    data: -0.27734375
    data: -0.296875
    data: -0.2265625
    data: 0.16015625
    data: 0.23046875
    data: -0.13671875
    data: -0.265625
    data: -0.05859375
    data: 0.05859375
    data: 0.15234375
    data: 0.16796875
    data: 0.01171875
    data: -0.03515625
    data: -0.01171875
    data: 0.015625
    data: 0.03125
    data: 0.046875
    data: -0.109375
    data: -0.13671875
    data: -0.19140625
    data: -0.15625
    data: 0.07421875
    data: 0.0625
    data: -0.08203125
    data: -0.08984375
    data: -0.18359375
    data: -0.2265625
    data: -0.125
    data: -0.07421875
    data: 0.125
    data: 0.234375
    data: 0.0703125
    data: -0.234375
    data: -0.35546875
    data: -0.16015625
    data: 0.09765625
    data: 0.2421875
    data: 0.12109375
    data: -0.26171875
    data: -0.26171875
    data: -0.01953125
    data: 0.02734375
    data: 0.0390625
    data: 0.05859375
    data: 0.0078125
    data: 0.0546875
    data: 0.09765625
    data: 0.02734375
    data: -0.015625
    data: 0.0
    data: 0.109375
    data: 0.1640625
    data: 0.09765625
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0.01171875
    data: 0.00390625
    data: -0.00390625
    data: 0.015625
    data: 0.01953125
    data: 0.0078125
    data: 0.00390625
    data: -0.01953125
    data: -0.015625
    data: 0.015625
    data: 0.015625
    data: 0.0078125
    data: -0.00390625
    data: -0.03125
    data: -0.02734375
    data: -0.00390625
    data: -0.0078125
    data: -0.00390625
    data: 0.0078125
    data: 0.01171875
    data: -0.01171875
    data: -0.03125
    data: -0.03125
    data: -0.01171875
    data: 0.015625
    data: 0.01171875
    data: -0.015625
    data: -0.02734375
    data: -0.04296875
    data: -0.0234375
    data: 0.01171875
    data: -0.0078125
    data: -0.0234375
    data: -0.00390625
    data: -0.015625
    data: -0.015625
    data: 0.015625
    data: 0.00390625
    data: -0.0078125
    data: -0.0078125
    data: -0.015625
    data: -0.0078125
    data: 0.0
    data: -0.0234375
    data: -0.0234375
    data: -0.00390625
    data: -0.01171875
    data: -0.01171875
    data: -0.0078125
    data: -0.02734375
    data: -0.02734375
    data: -0.01953125
    data: -0.015625
    data: -0.0078125
    data: 0.015625
    data: 0.0078125
    data: -0.00390625
    data: -0.01953125
    data: -0.01953125
    data: 0.0078125
    data: 0.0078125
    data: -0.01171875
    data: 0.0078125
    data: 0.0
    data: -0.01953125
    data: 0.00390625
    data: -0.00390625
    data: -0.015625
    data: -0.00390625
    data: 0.0
    data: -0.015625
    data: -0.0078125
    data: 0.01171875
    data: 0.0078125
    data: -0.01171875
    data: 0.0078125
    data: 0.015625
    data: 0.0
    data: 0.0
    data: -0.01953125
    data: -0.03515625
    data: 0.015625
    data: 0.0234375
    data: -0.0078125
    data: -0.01171875
    data: -0.02734375
    data: -0.03125
    data: -0.00390625
    data: -0.01171875
    data: -0.0234375
    data: 0.0
    data: -0.00390625
    data: 0.00390625
    data: 0.0234375
    data: 0.0078125
    data: -0.00390625
    data: -0.01171875
    data: -0.00390625
    data: 0.0234375
    data: 0.0390625
    data: 0.03515625
    data: 0.01171875
    data: -0.01171875
    data: 0.00390625
    data: 0.015625
    data: 0.00390625
    data: 0.00390625
    data: 0.0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0.25
    data: 0.30078125
    data: -0.01953125
    data: -0.18359375
    data: 0.015625
    data: 0.125
    data: 0.48046875
    data: 0.6875
    data: -0.16015625
    data: -0.68359375
    data: -0.35546875
    data: -0.0390625
    data: 0.6328125
    data: 1.171875
    data: 0.421875
    data: -0.40234375
    data: -0.58203125
    data: -0.296875
    data: 0.39453125
    data: 1.10546875
    data: 1.11328125
    data: 0.41796875
    data: -0.0078125
    data: -0.01953125
    data: -0.171875
    data: 0.3203125
    data: 0.8984375
    data: 0.67578125
    data: 0.6171875
    data: 0.34375
    data: -0.16796875
    data: 0.0
    data: 0.34765625
    data: 0.359375
    data: 0.41015625
    data: 0.234375
    data: -0.62890625
    data: -0.85546875
    data: -0.22265625
    data: -0.11328125
    data: -0.4140625
    data: -0.296875
    data: -0.72265625
    data: -1.3203125
    data: -1.1015625
    data: -0.68359375
    data: -0.4765625
    data: -0.29296875
    data: -0.26171875
    data: -0.93359375
    data: -1.484375
    data: -1.04296875
    data: -0.33984375
    data: -0.109375
    data: -0.08203125
    data: -0.25
    data: -0.44140625
    data: -0.41796875
    data: -0.11328125
    data: 0.02734375
    data: 0.20703125
    data: 0.8359375
    data: 0.90234375
    data: 0.8046875
    data: 1.015625
    data: 0.48046875
    data: 0.1171875
    data: 0.6171875
    data: 0.73828125
    data: 0.74609375
    data: 0.8515625
    data: 0.34375
    data: -0.04296875
    data: 0.0390625
    data: -0.1484375
    data: -0.359375
    data: -0.08984375
    data: 0.0390625
    data: 0.09375
    data: 0.23828125
    data: -0.0390625
    data: -0.390625
    data: -0.0625
    data: 0.140625
    data: 0.0546875
    data: 0.22265625
    data: 0.1484375
    data: -0.12890625
    data: 0.21875
    data: 0.33203125
    data: -0.2578125
    data: -0.2421875
    data: -0.0234375
    data: -0.18359375
    data: 0.359375
    data: 0.5078125
    data: -0.37890625
    data: -0.62890625
    data: -0.109375
    data: 0.2109375
    data: 0.58984375
    data: 0.51953125
    data: -0.1953125
    data: -0.359375
    data: -0.046875
    data: 0.296875
    data: 0.42578125
    data: 0.24609375
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0.00390625
    data: 0.01171875
    data: 0.01171875
    data: 0.00390625
    data: 0.00390625
    data: 0.0
    data: 0.00390625
    data: 0.01953125
    data: 0.01171875
    data: 0.0078125
    data: 0.0
    data: -0.0078125
    data: -0.00390625
    data: 0.0078125
    data: 0.00390625
    data: -0.0078125
    data: -0.0078125
    data: -0.01171875
    data: -0.0078125
    data: -0.00390625
    data: -0.01171875
    data: -0.015625
    data: -0.0078125
    data: -0.0078125
    data: -0.00390625
    data: -0.00390625
    data: -0.0078125
    data: -0.01171875
    data: -0.0078125
    data: -0.00390625
    data: 0.0
    data: 0.0
    data: 0.0
    data: -0.00390625
    data: -0.0078125
    data: 0.0
    data: 0.00390625
    data: 0.0
    data: 0.0
    data: 0.00390625
    data: -0.00390625
    data: -0.00390625
    data: 0.0
    data: -0.01171875
    data: -0.01171875
    data: 0.0078125
    data: 0.0
    data: -0.0078125
    data: 0.00390625
    data: 0.0
    data: 0.00390625
    data: 0.015625
    data: 0.0
    data: -0.0078125
    data: 0.0078125
    data: 0.015625
    data: 0.01953125
    data: 0.015625
    data: -0.0078125
    data: -0.0078125
    data: 0.0
    data: 0.0
    data: 0.01171875
    data: 0.01171875
    data: -0.00390625
    data: -0.0078125
    data: -0.00390625
    data: -0.0078125
    data: 0.00390625
    data: 0.0078125
    data: 0.0
    data: 0.0
    data: -0.00390625
    data: -0.00390625
    data: -0.00390625
    data: 0.0
    data: 0.01171875
    data: 0.0078125
    data: 0.00390625
    data: 0.0
    data: -0.015625
    data: -0.0078125
    data: 0.01171875
    data: 0.0078125
    data: 0.00390625
    data: -0.0078125
    data: -0.015625
    data: -0.0078125
    data: 0.0
    data: 0.0
    data: 0.0
    data: -0.0078125
    data: 0.0
    data: 0.00390625
    data: -0.0078125
    data: -0.00390625
    data: 0.0
    data: 0.00390625
    data: 0.0078125
    data: -0.0078125
    data: -0.01171875
    data: -0.00390625
    data: -0.00390625
    data: 0.0
    data: 0.0
    data: -0.01171875
    data: -0.00390625
    data: 0.00390625
    data: -0.00390625
    data: -0.01171875
    data: -0.0078125
    data: -0.0078125
    data: 0.0
    data: 0.0078125
    data: 0.0
    data: -0.0078125
    data: -0.01171875
    data: -0.0078125
    data: 0.01171875
    data: 0.015625
    data: -0.00390625
    data: -0.0078125
    data: 0.00390625
    data: 0.00390625
    data: 0.00390625
    data: 0.0078125
    data: -0.015625
    data: -0.01171875
    data: 0.01171875
    data: -0.00390625
    data: -0.00390625
    data: 0.0078125
    data: -0.00390625
    data: 0.00390625
    data: 0.0078125
    data: 0.00390625
    data: 0.0078125
    data: 0.00390625
    data: 0.0
    data: 0.00390625
    data: 0.00390625
    data: 0.0078125
    data: 0.0078125
    data: -0.00390625
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0.00390625
    data: 0.0078125
    data: -0.00390625
    data: -0.00390625
    data: 0.00390625
    data: 0.00390625
    data: 0.00390625
    data: 0.00390625
    data: 0.0
    data: 0.0
    data: 0.0078125
    data: 0.00390625
    data: 0.0
    data: 0.0
    data: -0.0078125
    data: 0.0
    data: -0.00390625
    data: -0.0078125
    data: 0.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -0.01171875
    data: -0.01171875
    data: 0.00390625
    data: -0.00390625
    data: 0.00390625
    data: 0.0078125
    data: -0.01171875
    data: -0.0078125
    data: 0.00390625
    data: 0.0
    data: -0.00390625
    data: 0.00390625
    data: -0.00390625
    data: -0.00390625
    data: -0.00390625
    data: -0.0078125
    data: -0.00390625
    data: 0.01171875
    data: 0.0078125
    data: 0.0
    data: -0.00390625
    data: 0.0
    data: 0.0078125
    data: 0.00390625
    data: 0.0
    data: 0.0
    data: -0.01171875
    data: -0.00390625
    data: 0.01171875
    data: -0.01171875
    data: -0.01171875
    data: 0.00390625
    data: -0.015625
    data: -0.015625
    data: 0.00390625
    data: -0.0078125
    data: -0.01171875
    data: -0.00390625
    data: -0.015625
    data: -0.01171875
    data: 0.00390625
    data: 0.00390625
    data: 0.00390625
    data: 0.0
    data: -0.0078125
    data: -0.0078125
    data: 0.0
    data: 0.0078125
    data: 0.01171875
    data: 0.0078125
    data: -0.00390625
    data: 0.0234375
    data: 0.00390625
    data: -0.0390625
    data: -0.0078125
    data: 0.0078125
    data: 0.01953125
    data: 0.07421875
    data: 0.0
    data: -0.12109375
    data: -0.09375
    data: -0.03125
    data: 0.0234375
    data: 0.04296875
    data: -0.01171875
    data: -0.09765625
    data: -0.1328125
    data: -0.0703125
    data: -0.01171875
    data: 0.0078125
    data: 0.0546875
    data: -0.00390625
    data: -0.0625
    data: -0.0234375
    data: 0.01953125
    data: 0.02734375
    data: 0.06640625
    data: 0.00390625
    data: -0.06640625
    data: -0.0078125
    data: 0.03125
    data: 0.01171875
    data: 0.0078125
    data: -0.00390625
    data: -0.046875
    data: -0.015625
    data: 0.0234375
    data: -0.00390625
    data: -0.02734375
    data: -0.03125
    data: -0.05859375
    data: -0.02734375
    data: 0.02734375
    data: 0.015625
    data: -0.02734375
    data: -0.05859375
    data: -0.05859375
    data: -0.015625
    data: -0.0078125
    data: 0.03515625
    data: 0.03515625
    data: -0.02734375
    data: -0.0234375
    data: -0.00390625
    data: -0.0390625
    data: -0.03125
    data: -0.01171875
    data: -0.0390625
    data: 0.0
    data: 0.015625
    data: -0.01953125
    data: -0.02734375
    data: 0.0
    data: -0.015625
    data: 0.03125
    data: 0.0546875
    data: 0.0078125
    data: 0.01953125
    data: 0.046875
    data: 0.01953125
    data: 0.0078125
    data: 0.02734375
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0.01171875
    data: -0.0078125
    data: -0.046875
    data: -0.0234375
    data: -0.015625
    data: -0.01953125
    data: -0.0234375
    data: -0.0703125
    data: -0.05859375
    data: 0.00390625
    data: 0.0
    data: -0.015625
    data: -0.05859375
    data: -0.07421875
    data: -0.01171875
    data: 0.05078125
    data: 0.03125
    data: -0.01953125
    data: -0.00390625
    data: 0.0
    data: 0.0234375
    data: 0.06640625
    data: 0.03515625
    data: -0.0078125
    data: 0.0390625
    data: 0.0390625
    data: 0.05859375
    data: 0.05859375
    data: 0.00390625
    data: 0.0
    data: 0.015625
    data: 0.02734375
    data: 0.0390625
    data: 0.015625
    data: -0.01953125
    data: -0.01171875
    data: -0.34375
    data: -0.41796875
    data: 0.0390625
    data: 0.203125
    data: 0.515625
    data: 0.42578125
    data: -0.58203125
    data: -0.89453125
    data: -0.27734375
    data: 0.4296875
    data: 1.359375
    data: 0.96484375
    data: -0.66015625
    data: -1.08203125
    data: -0.41015625
    data: 0.58984375
    data: 1.42578125
    data: 0.8515625
    data: -1.04296875
    data: -1.4453125
    data: -0.5703125
    data: 0.21484375
    data: 0.6796875
    data: 0.30078125
    data: -0.8359375
    data: -1.3984375
    data: -1.25
    data: -0.5703125
    data: -0.23046875
    data: -0.3515625
    data: -0.21875
    data: -0.5625
    data: -0.7734375
    data: -0.41796875
    data: -0.328125
    data: -0.33984375
    data: -0.375
    data: -0.55859375
    data: 0.0390625
    data: 0.35546875
    data: 0.21875
    data: 0.08984375
    data: -0.79296875
    data: -1.02734375
    data: 0.19921875
    data: 0.45703125
    data: -0.4296875
    data: -0.45703125
    data: -0.75390625
    data: -0.9296875
    data: -0.140625
    data: -0.2265625
    data: -1.16015625
    data: -0.8984375
    data: -0.26953125
    data: -0.55859375
    data: -0.71875
    data: -0.87890625
    data: -1.27734375
    data: -0.83203125
    data: 0.07421875
    data: 0.1015625
    data: 0.0625
    data: -0.3359375
    data: -1.3046875
    data: -0.9375
    data: 0.0078125
    data: 0.1953125
    data: 0.484375
    data: 0.2109375
    data: -0.53515625
    data: -0.453125
    data: -0.05859375
    data: 0.0078125
    data: 0.01171875
    data: 0.296875
    data: 0.62890625
    data: 0.27734375
    data: -0.02734375
    data: 0.1796875
    data: 0.28125
    data: 0.8203125
    data: 0.921875
    data: 0.17578125
    data: -0.109375
    data: -0.125
    data: 0.47265625
    data: 0.78125
    data: 0.02734375
    data: -0.265625
    data: -0.3359375
    data: -0.68359375
    data: 0.24609375
    data: 0.59375
    data: -0.3359375
    data: -0.33203125
    data: -0.58984375
    data: -1.1015625
    data: -0.1484375
    data: 0.68359375
    data: -0.02734375
    data: -0.3515625
    data: -0.39453125
    data: -0.7109375
    data: -0.1953125
    data: 0.34765625
    data: 0.04296875
    data: -0.1796875
    data: 0.01953125
    data: 0.54296875
    data: 0.99609375
    data: 0.390625
    data: -0.42578125
    data: -0.33984375
    data: -0.0703125
    data: 1.0
    data: 1.78515625
    data: 0.53515625
    data: -0.578125
    data: -0.40234375
    data: -0.109375
    data: 0.76171875
    data: 1.06640625
    data: 0.1015625
    data: -0.0078125
    data: 0.0859375
    data: -0.05078125
    data: 0.58984375
    data: 0.79296875
    data: -0.16015625
    data: -0.296875
    data: 0.01171875
    data: -0.0546875
    data: 0.47265625
    data: 0.70703125
    data: -0.55078125
    data: -1.12890625
    data: -0.3984375
    data: -0.01953125
    data: 0.1875
    data: 0.19140625
    data: -0.43359375
    data: -0.68359375
    data: -0.265625
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0.3203125
    data: 0.55078125
    data: 0.47265625
    data: 0.13671875
    data: 0.1640625
    data: 0.26953125
    data: 0.9765625
    data: 1.515625
    data: 1.125
    data: 0.68359375
    data: 0.66015625
    data: 0.5625
    data: 1.25390625
    data: 1.59765625
    data: 0.66796875
    data: 0.25390625
    data: 0.078125
    data: 0.1484375
    data: 0.4765625
    data: 0.65234375
    data: -0.04296875
    data: -0.78125
    data: -1.0625
    data: -0.5
    data: 0.86328125
    data: 1.1484375
    data: 0.6484375
    data: 0.1875
    data: -0.5234375
    data: -0.3515625
    data: 0.98046875
    data: 1.125
    data: 0.70703125
    data: 0.6796875
    data: 0.12109375
    data: 0.00390625
    data: -0.31640625
    data: -0.26953125
    data: 0.05859375
    data: 0.359375
    data: 0.50390625
    data: 0.15234375
    data: -0.75390625
    data: -0.9296875
    data: -0.27734375
    data: 0.69921875
    data: 1.49609375
    data: 0.6953125
    data: 0.15234375
    data: 0.12109375
    data: 0.1328125
    data: 1.0625
    data: 1.453125
    data: 0.55859375
    data: 1.7578125
    data: 2.72265625
    data: 1.3984375
    data: 1.13671875
    data: 1.32421875
    data: 0.62109375
    data: 2.05078125
    data: 3.55859375
    data: 2.078125
    data: 1.69921875
    data: 2.5
    data: 1.37109375
    data: 0.88671875
    data: 1.6171875
    data: 1.14453125
    data: 1.2890625
    data: 1.63671875
    data: 0.76171875
    data: -0.3515625
    data: -1.62890625
    data: -0.94140625
    data: 1.01171875
    data: 1.74609375
    data: 1.0703125
    data: -0.47265625
    data: -2.9140625
    data: -1.87109375
    data: 1.83984375
    data: 2.88671875
    data: 1.61328125
    data: 0.1640625
    data: -2.1953125
    data: -2.41796875
    data: 0.140625
    data: 0.45703125
    data: 0.26171875
    data: 0.81640625
    data: -1.0625
    data: -2.70703125
    data: -2.4921875
    data: -2.953125
    data: -1.2890625
    data: 1.3515625
    data: -0.140625
    data: -2.890625
    data: -4.05859375
    data: -4.15625
    data: -1.49609375
    data: 0.82421875
    data: 0.015625
    data: -1.66796875
    data: -2.26171875
    data: -1.88671875
    data: -0.48828125
    data: -0.484375
    data: -0.9765625
    data: -0.8671875
    data: 0.1484375
    data: 1.23828125
    data: 0.7109375
    data: -0.5546875
    data: -1.77734375
    data: -2.28515625
    data: 0.01171875
    data: 2.13671875
    data: 1.0625
    data: 0.015625
    data: -1.26171875
    data: -2.828125
    data: -0.44921875
    data: 1.5859375
    data: 0.48828125
    data: 0.578125
    data: 0.17578125
    data: -1.5078125
    data: 0.03125
    data: 1.8984375
    data: 0.7578125
    data: 0.81640625
    data: 1.49609375
    data: 0.3046875
    data: 0.15625
    data: 1.08203125
    data: 0.55078125
    data: 0.3203125
    data: 0.86328125
    data: 0.40625
    data: -0.19140625
    data: -0.12890625
    data: -0.07421875
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: -0.33203125
    data: -0.4921875
    data: -0.25390625
    data: -0.6171875
    data: -0.7578125
    data: -0.23828125
    data: -0.16796875
    data: -0.26171875
    data: -0.39453125
    data: -0.98828125
    data: -0.75
    data: -0.0625
    data: 0.09765625
    data: -0.234375
    data: -0.1796875
    data: 0.0
    data: -0.453125
    data: -0.30078125
    data: 0.29296875
    data: -0.42578125
    data: -0.05078125
    data: 1.1484375
    data: 0.640625
    data: 0.15625
    data: 0.34375
    data: -0.51171875
    data: -0.02734375
    data: 1.3125
    data: 1.21875
    data: 0.734375
    data: -0.01171875
    data: -0.546875
    data: -0.01171875
    data: 0.53515625
    data: 0.11328125
    data: 0.1015625
    data: 0.0859375
    data: 0.234375
    data: -0.65234375
    data: -1.140625
    data: -0.87890625
    data: -0.54296875
    data: 0.7890625
    data: 0.53515625
    data: -1.25
    data: -1.0546875
    data: -0.54296875
    data: -0.48828125
    data: 0.8828125
    data: 0.3828125
    data: -0.6796875
    data: 0.5546875
    data: 0.87890625
    data: 0.14453125
    data: 0.1796875
    data: -0.59375
    data: -1.171875
    data: 0.30078125
    data: 0.484375
    data: -0.21875
    data: -0.2421875
    data: -1.265625
    data: -1.28515625
    data: 0.07421875
    data: 0.34765625
    data: 0.0078125
    data: -0.2421875
    data: -0.58984375
    data: -0.19921875
    data: 0.2421875
    data: 0.40625
    data: 0.31640625
    data: -0.7109375
    data: 0.3359375
    data: 2.703125
    data: 2.14453125
    data: -0.3046875
    data: -0.79296875
    data: -0.73046875
    data: 1.84765625
    data: 4.6015625
    data: 1.765625
    data: -1.0625
    data: -0.8046875
    data: 0.46484375
    data: 2.60546875
    data: 1.84765625
    data: -1.1640625
    data: -0.390625
    data: 0.48046875
    data: 0.89453125
    data: 2.34375
    data: -0.703125
    data: -2.7890625
    data: 0.02734375
    data: 0.66015625
    data: 0.48828125
    data: 0.8046875
    data: -2.3515625
    data: -3.328125
    data: -0.60546875
    data: 0.0546875
    data: 0.078125
    data: -0.4453125
    data: -1.6953125
    data: -1.32421875
    data: -0.265625
    data: -0.11328125
    data: 0.10546875
    data: 1.29296875
    data: 2.75390625
    data: 1.99609375
    data: 0.1171875
    data: -0.3125
    data: -0.16796875
    data: 1.55078125
    data: 4.14453125
    data: 2.32421875
    data: -0.44921875
    data: -0.34375
    data: 0.3125
    data: 1.78515625
    data: 2.47265625
    data: -0.1328125
    data: -0.6953125
    data: 0.43359375
    data: 0.8984375
    data: 1.515625
    data: 0.46484375
    data: -0.7890625
    data: -0.1171875
    data: 0.52734375
    data: 0.61328125
    data: -0.23046875
    data: -1.7109375
    data: -1.0078125
    data: -0.3359375
    data: -0.1953125
    data: 0.30078125
    data: -0.21484375
    data: -1.09375
    data: -0.67578125
    data: -0.3515625
    data: -0.25390625
    data: 0.88671875
    data: 0.59375
    data: -0.62890625
    data: -0.1171875
    data: 0.88671875
    data: 0.66796875
    data: 1.00390625
    data: 0.4140625
    data: -0.56640625
    data: -0.01171875
    data: 1.46875
    data: 1.50390625
    data: 0.3828125
    data: -0.5703125
    data: -0.40234375
    data: 0.296875
    data: 0.9375
    data: 1.19140625
    data: 0.4765625
    data: -0.5234375
    data: -0.7109375
    data: 0.2578125
    data: -0.1015625
    data: -0.06640625
    data: -0.1953125
    data: -0.3046875
    data: -0.02734375
    data: -0.10546875
    data: -0.6328125
    data: -0.44140625
    data: -0.40234375
    data: -0.16796875
    data: 0.21875
    data: -0.17578125
    data: -0.1796875
    data: -0.01953125
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: -0.34765625
    data: -1.05078125
    data: -0.15625
    data: 1.328125
    data: 0.7421875
    data: -0.0390625
    data: -1.11328125
    data: -2.37890625
    data: 0.15234375
    data: 2.453125
    data: 0.484375
    data: -0.55078125
    data: -1.26953125
    data: -2.828125
    data: -0.3671875
    data: 1.81640625
    data: 0.484375
    data: -0.140625
    data: -0.39453125
    data: -2.25
    data: -2.15234375
    data: -0.08203125
    data: 0.94921875
    data: 0.73046875
    data: 0.296875
    data: -0.52734375
    data: -1.70703125
    data: -0.61328125
    data: 1.0703125
    data: 0.80078125
    data: 0.1875
    data: 0.21875
    data: -0.2265625
    data: 0.1640625
    data: 0.859375
    data: 0.4375
    data: 0.41015625
    data: 1.13671875
    data: -0.6328125
    data: -1.390625
    data: 0.51171875
    data: 0.5390625
    data: 0.0078125
    data: 0.41796875
    data: -1.59765625
    data: -1.96875
    data: 0.36328125
    data: 0.32421875
    data: -0.55078125
    data: -2.4609375
    data: -3.41015625
    data: -0.984375
    data: 0.625
    data: 0.109375
    data: 0.26953125
    data: -1.984375
    data: -3.03515625
    data: 0.44140625
    data: 1.6796875
    data: 0.45703125
    data: 0.7890625
    data: -0.79296875
    data: -2.68359375
    data: -0.0234375
    data: 1.2734375
    data: 0.19140625
    data: 0.37109375
    data: -0.546875
    data: -2.09765625
    data: -0.87109375
    data: 0.37109375
    data: 0.05859375
    data: 0.6328125
    data: 1.2890625
    data: 0.59375
    data: 0.28515625
    data: 0.70703125
    data: 0.359375
    data: 0.609375
    data: 0.97265625
    data: 0.640625
    data: -0.015625
    data: -0.125
    data: 0.171875
    data: -0.140625
    data: -1.37109375
    data: -1.41015625
    data: -0.80859375
    data: -0.4296875
    data: 0.20703125
    data: 0.05078125
    data: -1.625
    data: -1.88671875
    data: 0.16015625
    data: 0.9296875
    data: 0.5625
    data: -0.15625
    data: -2.13671875
    data: -1.79296875
    data: 0.44921875
    data: 0.921875
    data: 0.65625
    data: -0.32421875
    data: -1.56640625
    data: -1.36328125
    data: -0.21875
    data: 0.39453125
    data: 0.48828125
    data: 0.7109375
    data: 0.72265625
    data: -0.2578125
    data: -1.18359375
    data: -0.796875
    data: 0.1171875
    data: 0.28515625
    data: -1.08203125
    data: -2.84375
    data: -4.7890625
    data: -2.1796875
    data: 1.12890625
    data: -0.41015625
    data: -1.42578125
    data: -2.65625
    data: -5.6484375
    data: -2.71875
    data: 1.2890625
    data: -0.3046875
    data: -0.79296875
    data: -1.75390625
    data: -3.61328125
    data: -3.03515625
    data: -0.68359375
    data: -0.0625
    data: -0.4375
    data: -0.546875
    data: -0.83984375
    data: -1.765625
    data: -1.09765625
    data: 0.26171875
    data: 0.734375
    data: 1.13671875
    data: 0.734375
    data: -0.0625
    data: -0.1328125
    data: 0.15625
    data: 0.68359375
    data: 1.22265625
    data: 0.28125
    data: 0.328125
    data: 0.73828125
    data: -0.81640625
    data: -0.2109375
    data: 1.63671875
    data: 0.18359375
    data: -0.0703125
    data: 0.7734375
    data: -0.56640625
    data: 0.19921875
    data: 1.3046875
    data: -0.8359375
    data: -0.77734375
    data: 0.59765625
    data: 0.6328125
    data: 0.6484375
    data: -0.51171875
    data: -2.62109375
    data: -1.30859375
    data: 0.78515625
    data: 0.9375
    data: 0.0
    data: -1.41015625
    data: -1.94921875
    data: -0.83203125
    data: 0.64453125
    data: 0.7109375
    data: 0.44140625
    data: -0.01171875
    data: -0.06640625
    data: 0.09765625
    data: 0.421875
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: -0.29296875
    data: -0.27734375
    data: -0.83984375
    data: -1.703125
    data: -0.546875
    data: 0.296875
    data: 0.12890625
    data: 0.06640625
    data: -1.57421875
    data: -2.6171875
    data: -0.3125
    data: 0.79296875
    data: 0.96875
    data: 1.73828125
    data: 0.38671875
    data: -0.83203125
    data: 0.65625
    data: 1.109375
    data: 1.10546875
    data: 2.78125
    data: 2.83984375
    data: 1.44140625
    data: 1.8046875
    data: 1.52734375
    data: 0.63671875
    data: 0.76171875
    data: 0.484375
    data: -0.08203125
    data: -0.02734375
    data: 0.41796875
    data: 0.078125
    data: -0.62109375
    data: -1.234375
    data: -1.4375
    data: -1.41015625
    data: -0.5
    data: 0.22265625
    data: -0.3671875
    data: -0.859375
    data: -1.12890625
    data: -0.078125
    data: 0.77734375
    data: 0.2109375
    data: -0.9296875
    data: -2.078125
    data: -1.94921875
    data: 0.0
    data: 1.0078125
    data: 0.62109375
    data: 0.66796875
    data: -0.09375
    data: 0.15625
    data: 0.4921875
    data: 0.19921875
    data: 1.5078125
    data: 3.09765625
    data: 2.98046875
    data: 2.421875
    data: 1.33203125
    data: 0.3046875
    data: 0.48828125
    data: 1.76171875
    data: 1.953125
    data: 1.0625
    data: 0.22265625
    data: -0.16015625
    data: -0.38671875
    data: -0.10546875
    data: 0.09765625
    data: -0.3828125
    data: -0.6953125
    data: -0.49609375
    data: -0.30859375
    data: -0.80859375
    data: -0.75
    data: -0.43359375
    data: -0.17578125
    data: 0.00390625
    data: 0.01953125
    data: -1.11328125
    data: -2.28515625
    data: -0.8828125
    data: 0.3515625
    data: 0.0859375
    data: 0.5546875
    data: 1.43359375
    data: 0.7734375
    data: 0.51171875
    data: 0.09765625
    data: -0.515625
    data: -0.25
    data: 3.54296875
    data: 6.91015625
    data: 5.32421875
    data: 3.75390625
    data: 1.54296875
    data: -0.3671875
    data: 2.421875
    data: 7.1171875
    data: 7.9765625
    data: 6.515625
    data: 2.87109375
    data: 0.109375
    data: 0.6171875
    data: 2.51953125
    data: 3.609375
    data: 2.33203125
    data: 0.73046875
    data: -0.25390625
    data: -0.69921875
    data: -0.23828125
    data: 0.38671875
    data: -0.63671875
    data: -0.81640625
    data: -1.37890625
    data: -1.47265625
    data: -0.4140625
    data: -0.140625
    data: -0.58203125
    data: -0.76171875
    data: -0.328125
    data: 0.515625
    data: 0.90625
    data: -0.56640625
    data: -1.33203125
    data: -0.70703125
    data: 3.11328125
    data: 3.37890625
    data: 1.08203125
    data: 0.33203125
    data: -1.859375
    data: -1.37109375
    data: 3.9296875
    data: 4.546875
    data: 1.0390625
    data: -0.34375
    data: -1.546875
    data: -0.78125
    data: 1.6171875
    data: 2.45703125
    data: 1.03515625
    data: -0.7109375
    data: -1.07421875
    data: -0.16796875
    data: 0.73828125
    data: 1.32421875
    data: 2.09375
    data: 3.0859375
    data: 2.43359375
    data: 0.85546875
    data: 1.62109375
    data: 4.00390625
    data: 5.4140625
    data: 4.43359375
    data: 2.95703125
    data: 1.5546875
    data: 0.89453125
    data: 2.7109375
    data: 3.81640625
    data: 1.61328125
    data: -0.109375
    data: 0.28125
    data: -0.76953125
    data: -3.01953125
    data: -4.1953125
    data: -3.6328125
    data: -2.2734375
    data: -0.5859375
    data: -1.88671875
    data: -5.29296875
    data: -7.9609375
    data: -7.96484375
    data: -4.5703125
    data: -1.16015625
    data: -1.10546875
    data: -2.2421875
    data: -3.26953125
    data: -4.0703125
    data: -2.9296875
    data: -0.9921875
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: 0
    data: -0.29296875
    data: -1.29296875
    data: -1.08203125
    data: 0.14453125
    data: 0.23828125
    data: 0.01171875
    data: -0.4140625
    data: -1.62890625
    data: -1.328125
    data: -0.1015625
    data: -0.31640625
    data: -0.33203125
    data: 0.375
    data: -0.203125
    data: -0.69140625
    data: -0.59375
    data: -0.5859375
    data: -0.109375
    data: 0.4375
    data: 0.26171875
    data: -0.68359375
    data: -1.28515625
    data: -0.58984375
    data: 0.1875
    data: -0.36328125
    data: -0.6875
    data: -0.734375
    data: -0.90234375
    data: -0.3984375
    data: 0.09375
    data: -0.3046875
    data: -0.81640625
    data: -0.49609375
    data: 0.0390625
    data: 0.16796875
    data: 0.14453125
    data: 0.0546875
    data: 0.52734375
    data: 0.890625
    data: -0.66796875
    data: -1.1875
    data: -0.10546875
    data: 0.6328125
    data: 2.0234375
    data: 1.68359375
    data: -1.29296875
    data: -1.27734375
    data: 0.30859375
    data: 0.5390625
    data: 0.99609375
    data: 0.0390625
    data: -0.70703125
    data: 0.3125
    data: 0.59765625
    data: -0.0390625
    data: 0.109375
    data: -0.125
    data: -0.34765625
    data: 0.1015625
    data: 0.17578125
    data: 0.61328125
    data: 0.5546875
    data: -1.1953125
    data: -1.72265625
    data: -0.265625
    data: 0.3203125
    data: 0.6171875
    data: -0.0546875
    data: -1.828125
    data: -1.453125
    data: 0.03515625
    data: 0.33203125
    data: 1.05859375
    data: 1.03515625
    data: -0.01171875
    data: -0.2734375
    data: -0.890625
    data: -0.60546875
    data: 1.12890625
    data: 0.83984375
    data: 0.03515625
    data: 0.14453125
    data: -0.67578125
