name: "SimpleNet2"
layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param { shape: { dim: 20 dim: 20 dim: 1 } }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  convolution_param {
    num_output: 8
    kernel_size: 3
    stride: 1
  }
  blobs {
    data: 1.0
    data: 0.0
    data: -1.0
    data: 2.0
    data: 0.0
    data: -2.0
    data: 1.0
    data: 0.0
    data: -1.0
    data: 1.0
    data: 0.0
    data: -1.0
    data: 2.0
    data: 0.0
    data: -2.0
    data: 1.0
    data: 0.0
    data: -1.0
    data: 1.0
    data: 0.0
    data: -1.0
    data: 2.0
    data: 0.0
    data: -2.0
    data: 1.0
    data: 0.0
    data: -1.0
    data: 1.0
    data: 0.0
    data: -1.0
    data: 2.0
    data: 0.0
    data: -2.0
    data: 1.0
    data: 0.0
    data: -1.0
    data: 1.0
    data: 0.0
    data: -1.0
    data: 2.0
    data: 0.0
    data: -2.0
    data: 1.0
    data: 0.0
    data: -1.0
    data: 1.0
    data: 0.0
    data: -1.0
    data: 2.0
    data: 0.0
    data: -2.0
    data: 1.0
    data: 0.0
    data: -1.0
    data: 1.0
    data: 0.0
    data: -1.0
    data: 2.0
    data: 0.0
    data: -2.0
    data: 1.0
    data: 0.0
    data: -1.0
    data: 1.0
    data: 0.0
    data: -1.0
    data: 2.0
    data: 0.0
    data: -2.0
    data: 1.0
    data: 0.0
    data: -1.0
    shape {
       dim: 1
       dim: 8
       dim: 3
       dim: 3
    }
  }
  blobs {
    data: 0.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: 0.0
    shape: {
        dim: 8
    }
  }
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "conv1"
  top: "conv2"
  convolution_param {
    num_output: 8
    kernel_size: 3
    pad: 0
  }
  blobs {
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    data: 1.0
    data: 2.0
    data: 1.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: -1.0
    data: -2.0
    data: -1.0
    shape: {
        dim: 8
        dim: 8
        dim: 3
        dim: 3
    }
  }
  blobs {
    data: 0.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: 0.0
    data: 0.0
    shape: {
        dim: 8
    }
  }
}
